weapon_perks = ['Невосприимчивый', 'Пламенный', 'Вампирский', 'Смертельный'] # 0 - игнор брони, 1 - доп урон огнем, 2 - восстановление хп от урона
# 3 - шанс убить с одного удара

armor_perks = ['Драконий', 'Шипованный', 'Изворотливый', 'Заживляющий'] # 0 - двойная броня, 1 - отражение урона, 2 - двойной рейтинг уклонения,
# 3 - невосприимчивость к кровотечению

weapon_names = ['Меч солнца', 'Меч ночи', 'Палка пастуха', 'Космический меч', 'Древний меч', 'Хитиновый меч']

armor_names_head = ['Шлем солнца', 'Шлем ночи', 'Шляпа пастуха', 'Космический шлем', 'Древний шлем', 'Хитиновый шлем']

armor_names_body = ['Нагрудник солнца', 'Нагрудник ночи', 'Рубаха', 'Космический нагрудник', 'Древний нагрудник', 'Хитиновый нагрудник']

armor_names_legs = ['Штаны солнца', 'Штаны ночи', 'Штаны фермера', 'Космические штаны', 'Древние штаны', 'Хитиновые штаны']

armor_names_boots = ['Сапоги солнца', 'Сапоги ночи', 'Сланцы пастуха', 'Космические сапоги', 'Древние сапоги', 'Хитиновые сапоги']