def rocket():
    print('''Правила игры:
            1. У вас есть начальный баланс, который вы видите при входе в игру.
            2. Вы можете выбрать одну из следующих опций:
            (1) - Играть: Ставьте деньги и участвуйте в игре.
            (2) - Правила: Просмотрите правила игры.
            (3) - Выйти: Выйти из игры.

            Правила ставок:
            1. Выберите сумму, которую хотите поставить.
            2. Сумма ставки должна быть не больше вашего текущего баланса.
            3. Ставка уменьшит ваш баланс.

            Игровой процесс:
            1. После сделанной ставки, вы увидите текущий потенциальный выигрыш.
            2. Вы можете решить, хотите ли вывести выигрыш или продолжить игру.
            (1) - Да: Вывести выигрыш и увеличить ваш баланс.
            (2) - Нет: Продолжить игру.

            Игровая механика:
            1. При выборе "Нет", вы будете участвовать в мини-игре с ракетой.
            2. Шанс успеха в этой мини-игре составляет 66% (2 из 3).
            3. Если ракета не разбивается, ваш выигрыш увеличивается на 50%.
            4. Если ракета разбивается, игра завершается, и вы теряете свою текущую ставку.

            Советы для игроков:
            1. Управляйте своим балансом и не делайте слишком большие ставки.
            2. Помните, что у игры всегда есть элемент случайности, и выигрыш не гарантирован. ''')