def roulette():
    print('''Игровой процесс:

            При запуске игры у вас есть определенное количество денег, которые вы видите как "У вас [сумма]$".

            Выберите один из следующих вариантов:

            (1) - Играть: Начните новый раунд, ставя определенную сумму денег.
            (2) - Правила: Просмотрите правила игры (вы сейчас читаете их).
            (3) - Выйти: Завершите игру и выйдите из нее.
            Если вы выбрали "Играть," то:

            Введите ставку, указав сумму денег, которую вы хотите поставить.
            Сумма ставки будет вычтена из вашего общего баланса.
            Затем бросается кубик с числами от 0 до 36, и выпадает случайное число (dice).
            Выберите, на что вы ставите:

            (1) - Точное число: Выберите одно число от 0 до 36.
            (2) - Четное/нечетное: Выберите, будет ли выпавшее число четным или нечетным.
            В зависимости от вашего выбора:

            Если вы выбрали "Точное число" и угадали число, вы получите выигрыш в 36 раз больше вашей ставки.
            Если вы выбрали "Точное число" и не угадали число, вы проиграете вашу ставку.
            Если вы выбрали "Четное/нечетное" и угадали правильно, вы получите выигрыш в 2 раза больше вашей ставки.
            Если вы выбрали "Четное/нечетное" и не угадали, вы проиграете вашу ставку.
            Ваш текущий баланс обновляется в соответствии с результатом броска и вашей ставкой.

            Игра продолжается снова с пункта 2, и вы можете играть, просматривать правила или выходить из игры.

            Продолжайте играть и ставить, пока не решите завершить игру.''')